app/controllers/products_controller.rb

  def index
    @products = Product.order('id ASC').page(params[:page]).per(20)
---
SELECT  `products`.* FROM `products`  ORDER BY id DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM `products`

  def show
    @product = Product.find(params[:id])
    #実装商品詳細ページ、ページネーション
    @product2 = Product.find(params[:id]).reviews.order('created_at DESC').page(params[:page]).per(10)
---
SELECT  `products`.* FROM `products` WHERE `products`.`id` = 0 LIMIT 1
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`product_id` = 1
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1  ORDER BY created_at DESC

  def search
    @products = Product.where('title LIKE(?)',"%#{params[:keyword]}%").page(params[:page]).per(10)
---
SELECT  `products`.* FROM `products` WHERE (title LIKE('%%')) LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `products` WHERE (title LIKE('%%'))