app/controllers/reviews_controller.rb

  def create
    Review.create(create_params)
---
INSERT INTO `reviews` (`rate`, `review`, `product_id`, `nickname`, `created_at`, `updated_at`) VALUES (1, '小野恵太のダーツは最高！', 1, 'いけだ', '2017-05-12 08:56:04', '2017-05-12 08:56:04')

  def destroy
    review = Review.find(params[:id])
    if review.user_id == current_user.id
      review.destroy
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 14 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 14