app/controllers/users_controller.rb

  def show
    @reviews = current_user.reviews.order('updated_at DESC').page(params[:page]).per(12)
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`user_id` = 2
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`user_id` = 2  ORDER BY updated_at DESC