app/views/products/index.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1
---

                      <% if product.reviews.present? %>