app/views/products/show.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`product_id` = 1  ORDER BY created_at DESC
---
              <ul style="padding: 0">
              <% @product.reviews.each do |review| %>